Revit 2024 API
ElementIntersectsFilter Class
 A base class for filters used to match elements which intersect with geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class ElementIntersectsFilter : ElementSlowFilter
Visual Basic
Public Class ElementIntersectsFilter _
	Inherits ElementSlowFilter
Visual C++
public ref class ElementIntersectsFilter : public ElementSlowFilter
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementSlowFilter
 Autodesk.Revit.DB.ElementIntersectsFilter
 Autodesk.Revit.DB.ElementIntersectsElementFilter
 Autodesk.Revit.DB.ElementIntersectsSolidFilter
See Also
ElementIntersectsFilter Members
Autodesk.Revit.DB Namespace